#### Terraform Format and Style 🖌`success`
#### Terraform Initialization ⚙️`success`
#### Terraform Validation 🤖`success`
<details><summary>Validation Output</summary>

```

Success! The configuration is valid.


```

</details>

#### Terraform Plan 📖`success`

<details><summary>Show Plan</summary>

```

terraform
Running plan in Terraform Cloud. Output will stream here. Pressing Ctrl-C
will stop streaming the logs, but will not stop the plan running remotely.

Preparing the remote plan...

To view this run in a browser, visit:
https://app.terraform.io/app/lujop/catinfosalut/runs/run-QuLNjAgfcYbnPwxp

Waiting for the plan to start...

Terraform v1.2.3
on linux_amd64
Initializing plugins and modules...
aws_iam_role.lambda_exec: Refreshing state... [id=serverless_lambda]
aws_lambda_function.catinfosalut: Refreshing state... [id=hello_function]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
  ~ update in-place

Terraform will perform the following actions:

  # aws_api_gateway_integration.integration will be created
  + resource "aws_api_gateway_integration" "integration" {
      + cache_namespace         = (known after apply)
      + connection_type         = "INTERNET"
      + http_method             = "GET"
      + id                      = (known after apply)
      + integration_http_method = "POST"
      + passthrough_behavior    = (known after apply)
      + resource_id             = (known after apply)
      + rest_api_id             = (known after apply)
      + timeout_milliseconds    = 29000
      + type                    = "AWS_PROXY"
      + uri                     = "arn:aws:apigateway:eu-west-1:lambda:path/2015-03-31/functions/arn:aws:lambda:eu-west-1:278671691686:function:hello_function/invocations"
    }

  # aws_api_gateway_method.method will be created
  + resource "aws_api_gateway_method" "method" {
      + api_key_required = false
      + authorization    = "NONE"
      + http_method      = "GET"
      + id               = (known after apply)
      + resource_id      = (known after apply)
      + rest_api_id      = (known after apply)
    }

  # aws_api_gateway_resource.hello will be created
  + resource "aws_api_gateway_resource" "hello" {
      + id          = (known after apply)
      + parent_id   = (known after apply)
      + path        = (known after apply)
      + path_part   = "resource"
      + rest_api_id = (known after apply)
    }

  # aws_api_gateway_rest_api.CatInfoSalutAPI will be created
  + resource "aws_api_gateway_rest_api" "CatInfoSalutAPI" {
      + api_key_source               = (known after apply)
      + arn                          = (known after apply)
      + binary_media_types           = (known after apply)
      + created_date                 = (known after apply)
      + description                  = (known after apply)
      + disable_execute_api_endpoint = (known after apply)
      + execution_arn                = (known after apply)
      + id                           = (known after apply)
      + minimum_compression_size     = -1
      + name                         = "CatInfoSalutAPI"
      + policy                       = (known after apply)
      + root_resource_id             = (known after apply)
      + tags_all                     = (known after apply)

      + endpoint_configuration {
          + types            = (known after apply)
          + vpc_endpoint_ids = (known after apply)
        }
    }

  # aws_lambda_function.catinfosalut will be updated in-place
  ~ resource "aws_lambda_function" "catinfosalut" {
        id                             = "hello_function"
      ~ last_modified                  = "2022-06-19T18:25:30.000+0000" -> (known after apply)
      ~ source_code_hash               = "JlY2gxxUKNDYFb3aBOpXhJvXreRadQqn4C9r4vAGhUw=" -> "c5oiiiv3sZPx9hgITpKS/zuUKF4nCq+sQVX1o3MYTsc="
        tags                           = {}
        # (18 unchanged attributes hidden)



        # (3 unchanged blocks hidden)
    }

  # aws_lambda_permission.api_gateway_catinfosalut will be created
  + resource "aws_lambda_permission" "api_gateway_catinfosalut" {
      + action              = "lambda:InvokeFunction"
      + function_name       = "hello_function"
      + id                  = (known after apply)
      + principal           = "apigateway.amazonaws.com"
      + source_arn          = (sensitive)
      + statement_id        = "AllowExecutionFromAPIGateway"
      + statement_id_prefix = (known after apply)
    }

Plan: 5 to add, 1 to change, 0 to destroy.


```

</details>

*Pusher: @lujop, Action: `pull_request`, Working Directory: ``, Workflow: `Main workflow on push`*